Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/the_irish_education_system/special_education.html.txt.tmx
Source language: en
Languages: ga

source: • Organisations and statutory bodies with a role in special needs education
ga: • Cá háit a ndéanfaidh mé iarratas

source: Special needs education means the special educational arrangements which are in place for children with disabilities
ga: Ciallaíonn riachtanais speisialta oideachais na socruithe speisialta oideachais atá i bhfeidhm do leanaí a bhfuil míchumas orthu

source: All children – including children with disabilities and children with special needs – have a constitutional right to free primary education
ga: Tá ceart bunreachtúil ag gach leanbh – lena n-áirítear leanaí a bhfuil míchumas orthu agus leanaí a bhfuil riachtanais speisialta acu – bunoideachas a fháil saor in aisce

source: Children with special educational needs have the right to free primary education up to age 18 see ‘The law on special needs education’ below
ga: Tá ceart ag leanaí a bhfuil riachtanais speisialta oideachais acu bunoideachas a fháil saor in aisce suas go dtí aois 18

source: In the Irish Constitution there is information about the role of the State in providing education and the rights of parents
ga: Tá tuilleadh eolais faoin dlí faoi oideachas riachtanais speisialta le fáil i Tuilleadh mar gheall ar an ábhar seo

source: You are a person with special educational needs if your capacity to participate in and benefit from education is restricted due to an enduring physical, sensory, mental health or learning disability
ga: Is duine le riachtanais speisialta oideachais thú má tá do chumas a bheith páirteach i agus tairbhe a bhaint as oideachas teoranta de dheasca a bheith faoi mhíchumais seasmhach fisiceach, céadfach, sláinte mheabhrach nó foghlama

source: The policy is to provide special needs education in mainstream settings as far as possible. The Education for Persons with Special Educational Needs Act 2004 (pdf) provides that children are to be educated in an inclusive setting unless this would not be in the best interests of the child or the effective provision of education for other children in mainstream education
ga: Is é an polasaí ná oideachas riachtanas speisialta a chur ar fáil i suímh den phríomhshruth chomh fada agus is féidir.Forálann an Acht um Oideachas do Dhaoine a bhfuil Riachtanais Speisialta Oideachais Orthu 2004 (pdf) go bhfuil leanaí le hoideachas a fháil i suíomh cuimsitheach mura mbeadh sé seo ar leasa an linbh nó ar leasa soláthar éifeachtach oideachais do leanaí eile in oideachas den phríomhshruth

source: The National Council for Special Education (NCSE) has published an information booklet for parents, Children with Special Educational Needs (pdf)
ga: D’fhoilsíodh an Chomhairle Náisiúnta um Oideachas Speisialta bileog fhaisnéise do thuismitheoirí, Leanaí a bhfuil Riachtanais Speisialta Oideachais Acu (pdf)

source: Education for children with special needs may be provided in mainstream classes in mainstream schools, in special classes in mainstream schools or in special schools
ga: Is féidir oideachas do leanaí a bhfuil riachtanais speisialta acu a chur ar fáil i ngnáthranganna i scoileanna den phríomhshruth, i ranganna speisialta i scoileanna den phríomhshruth nó i scoileanna speisialta

source: Many children with disabilities or special needs are in mainstream classes in mainstream schools
ga: Tá a lán leanaí a bhuil míchumais orthu nó a bhfuil riachtanais speisialta acu i ngnáthranganna i scoileanna den phríomhshruth

source: They may get help from learning support and resource teachers and care support from special needs assistants (SNAs)
ga: B’fhéidir go bhfaighidís cuidiú a fháil ó mhúinteoirí tacaíochta foghlama nó ó mhúinteoirí acmhainní foghlama agus ó chúntóirí riachtanas speisialta (SNAanna)

source: You can read more about these supports for children with special educational needs in our documents on special needs education in primary schools and post-primary schools
ga: Tá na tacaíochtaí seo do leanaí a bhfuil riachtanais speisialta oideachais acu ar fáil i bunscoileanna agus iar-bhunscoileanna

source: Special classes in mainstream schools
ga: Ranganna speisialta i scoileanna príomhshrutha

source: Some children attend special classes in mainstream schools. These classes generally have low pupil/teacher ratios. Special schools
ga: Freastalaíonn roinnt leanaí ar ranganna speisialta i scoileanna den phríomhshruth

source: There are over 140 special schools catering for particular types of disability and special needs
ga: De ghnáth bíonn cóimheasanna ísle múinteoir le daltaí sna ranganna seo

source: You can find the special schools in your area on the website of the Department of Education and Skills
ga: Tá scoileanna speisialta ar suíomh gréasáin na Ranna Oideachais agus Scileanna

source: Special arrangements for particular disabilities
ga: Socruithe speisialta do mhíchumais ar leith

source: Students with specific leaning disabilities may be able to get an exemption from some of the usual educational requirements
ga: Is féidir le daltaí a bhfuil míchumais sainiúla foghlama a bheith in ann díolúine a fháil ó chuid de na gnáthriachtanais oideachais

source: For example, if you have dyslexia you may be exempt from the requirement to study Irish and/or a continental language
ga: Mar shampla, má tá disléices ort b’fhéidir go mbeifeá díolmhaithe ó riachtanas staidéar a dhéanamh ar an nGaeilge agus/nó teanga ón mhór-roinn

source: Under the Education for Persons with Special Educational Needs Act 2004 (the EPSEN Act) each child assessed with a special educational need should have a personal education plan
ga: Faoin Acht um Oideachas do Dhaoine a bhfuil Riachtanais Speisialta Oideachais acu 2004 ba cheart go mbeadh plean pearsanta oideachais ag gach leanbh a meastar go bhfuil riachtanais speisialta oideachais acu

source: This system is not yet in place but its implementation is being coordinated by the National Council for Special Education (NCSE) which has published Guidelines for the Individual Education Plan process (pdf)
ga: Níl an córas seo ag feidhmiú fós ach tá a chur i bhfeidhm á chomhordú ag an gComhairle Náisiúnta um Oideachas Speisialta (CNOS) a d’fhoilsigh Treoirlínte do Phróiseas an Phlean Aonair Oideachais (pdf)

source: The NCSE has also published Implementation Report: Plan for the Phased Implementation of the EPSEN Act 2004
ga: D’fhoilsigh an CNOS Tuarascáil ar Chur i bhFeidhm: Plean le hAghaidh Cur i bhFeidhm Céimithe an Achta EPSEN 2004 chomh maith

source: This sets out how the Act can be implemented
ga: Leagann sé seo amach an dóigh ar féidir an tAcht a chur i bhfeidhm

source: However there is currently no date for the implementation of the assessment of need and individual education plans
ga: Áfach níl aon dáta faoi láthair (2009) an measúnú ar riachtanais agus plean pearsanta oideachais á chur i bhfeidhm

source: Special transport arrangements, including escorts and safety harnesses are available for children with disabilities attending school
ga: Tá Socruithe speisialta iompair, lena n-áirítear coimhdirí agus úmacha slándála ar fáil do leanaí a bhfuil míchumais orthu atá ag freastal ar scoil

source: Organisations and statutory bodies with a role in special needs education
ga: Eagraíochtaí agus comhlachtaí reachtúla a bhfuil ról acu san oideachas riachtanas speisialta

source: The National Council for Special Education
ga: An Chomhairle Náisiúnta um Oideachas Speisialta

source: The National Council for Special Education (NCSE) is a statutory body with particular functions in relation to special needs education
ga: Is comhlacht reachtúil é an Chomhairle Náisiúnta um Oideachas Speisialta a bhfuil feidhmeanna áirithe aige maidir le hoideachas riachtanais speisialta

source: Its main functions are:
ga: Is iad seo a phríomhfheidhmeanna:

source: • Planning and co-ordinating the provision of education and support services to children with special educational needs (in conjunction with schools and the Health Service Executive (HSE)
ga: • Soláthar seirbhísí oideachais agus tacaíochta do leanaí a bhfuil riachtanais speisialta oideachais acu a phleanáil agus a chomhordú (i gcomhar le scoileanna agus leis an bhFeidhmeannacht Seirbhíse Sláinte (FSS)

source: • Planning the implementation of the Education for Persons with Special Needs Act – see above
ga: • Cur i bhfeidhm an Achta um Oideachas do Dhaoine a bhfuil Riachtanais Speisialta Oideachais acu a phleanáil

source: • Disseminating information on best practice concerning the education of children with special educational needs
ga: • Faisnéis a scaipeadh maidir leis an gcleachtas is fearr maidir le hoideachas leanaí a bhfuil riachtanais speisialta oideachais acu

source: • Providing information to parents in relation to the entitlements of children with special educational needs
ga: • Faisnéis a chur ar fáil do thuismitheoirí maidir le teidlíochtaí leanaí a bhfuil riachtanais speisialta oideachais acu

source: • Assessing and reviewing resources required by children with special educational needs
ga: • Measúnú agus athbhreithniú a dhéanamh ar acmhainní atá de dhíth ar leanaí a bhfuil riachtanais speisialta oideachais acu

source: • Ensuring that progress of students with special educational needs is monitored and reviewed
ga: • Cinntiú go ndéantar monatóireacht agus athbhreithniú ar dhul chun cinn mac léinn a bhfuil riachtanais speisialta oideachais acu

source: • Reviewing education provision for adults with disabilities
ga: • Athbhreithniú a dhéanamh ar sholáthar oideachais d’aosaigh a bhfuil míchumais orthu

source: • Advising educational institutions on best practice
ga: • Institiúidí oideachais a chomhairliú maidir leis an gcleachtas is fear

source: • Consulting with voluntary bodies
ga: • Comhairliú le comhlachtaí deonacha

source: • Advising the Minister for Education and Skills on matters relating to special education
ga: • Comhairle a thabhairt don Aire Oideachais agus Scileanna ar rudaí a bhaineann leis an oideachas speisialta

source: • Conducting research and publishing findings
ga: • Taighde a dhéanamh agus torthaí a fhoilsiú

source: Special Educational Needs Organisers
ga: Eagarthóirí Riachanais Speisialta Oideachais

source: The NCSE employs over 80 Special Educational Needs Organisers (SENOs) who are responsible for allocating additional teaching and other resources to support the special educational needs of children with disabilities at local level
ga: Fostaíonn an CNOS breis agus 80 Eagraitheoirí Riachtanas Speisialta Oideachais (SENOanna) atá freagrach as teagasc breise agus acmhainní eile a dháileadh chun tacaíocht a thabhairt do riachtanais oideachais speisialta leanaí a bhfuil míchumais orthu ar leibhéal áitiúil

source: SENOs are the point of contact for parents/guardians and schools
ga: Is iad na SENOanna an pointe teagmhála do thuismitheoirí/ghairdiain agus scoileanna

source: Their main activities are:
ga: Is iad seo a leanas na príomhghníomhaíochtaí atá acu:

source: • Processing applications from all schools for resource teacher support in respect of children with low-incidence disabilities such as moderate general learning disabilities, visual or hearing impairments, physical disabilities or autism, and deciding on the level of support appropriate to the school
ga: • Iarratais ó gach scoil a phróiseáil maidir le tacaíocht múinteoirí acmhainne maidir le leanaí a bhfuil míchumais íosmhinicíochta orthu amhail míchumais mheasartha ghinearálta foghlama, laigí radhairc nó éisteachta, míchumais fhisiceacha nó uathachas, agus ag cinneadh ar leibhéal na tacaíochta atá fóirsteanach don scoil

source: • Processing applications from second-level schools for resource teacher support in respect of children with high-incidence disabilities such as mild general learning disability and deciding on the level of support appropriate to the school
ga: • Iarratais a phróiseáil ó scoileanna dara leibhéal do thacaíocht mhúinteora acmhainní maidir le leanaí le míchumais ardmhinicíochta amhail mion-mhíchumas ginearálta foghlama agus ag cinneadh ar leibhéal na tacaíochta atá fóirsteanach don scoil

source: • Processing applications from schools and deciding on the appropriate level of special needs assistant support for children with disabilities
ga: • Iarratais ó scoileanna a phróiseáil agus leibhéal cuí na tacaíochta ó chúntóir riachtanas speisialta a chinneadh do leanaí a bhfuil míchumais orthu

source: • Examining applications from all schools for special equipment/assistive technology (decisions on this are made by the Department of Education and Skills)
ga: • Iarratais ar threalamh speisialta/teicneolaíocht cúnaimh a scrúdú ó na scoileanna go léir (is í an Roinn Oideachais agus Scileanna a dhéanann cinntí faoi seo)

source: • Examining applications from schools for transport arrangements for children with disabilities and making recommendations to the Department of Education and Skills
ga: • Iarratais ó scoileanna ar shocruithe iompair do leanaí a bhfuil míchumais orthu a scrúdú agus moltaí a dhéanamh leis an Roinn Oideachais agus Scileanna

source: • Identifying the appropriate educational setting for individual children with special educational needs
ga: • Ag aithint an tsuímh oideachais atá oiriúnach do leanaí aonair a bhfuil riachtanais speisialta oideachais acu

source: SENOs also provide advice and support for parents of children with special educational needs
ga: Tá liosta SENOanna ar fáil ar shuíomh gréasáin na Comhairle Náisiúnta um Oideachas Speisialta

source: The National Council for Curriculum and Assessment
ga: An Chomhairle Náisiúnta um Churaclam agus Mheasúnú

source: The National Council for Curriculum and Assessment (NCCA) is a statutory body
ga: Is comhlacht reachtúil é an Chomhairle Náisiúnta Curaclaim agus Mheasúnachta (CNCM)

source: One of its functions is to advise the Minister for Education and Skills on the curriculum and syllabus requirements of students with disabilities or with special educational needs
ga: Ceann de na feidhmeanna atá aici ná comhairle a thabhairt don Aire Oideachais agus Scileanna ar an gcuraclam agus riachtanais siollabais mac léinn a bhfuil míchumais orthu nó riachtanais speisialta acu

source: The Council has published Guidelines for Teachers of Students with General Learning Disabilities
ga: Tá Tá Treoirlínte do Mhúinteoirí Daltaí a bhfuil Míchumais Ghinearálta Foghlama orthu foilsithe ag an gComhairle

source: The NCCA has also produced draft guidelines for teachers of exceptionally able students
ga: Chomh maith leis sin tá an CNCM ag forbairt treoirlínte faoi láthair do mhúinteoirí a bhfuil mic léinn atá thar a bheith cumasach acu

source: The Special Education Support Service (SESS)
ga: Seirbhís Tacaíochta don Oideachas Speisialta

source: The Special Education Support Service (SESS) was established to manage, co-ordinate and develop a range of supports in response to the identified training needs of teachers
ga: Bhunaigh an Roinn Oideachais agus Scileanna an tSeirbhís Tacaíochta don Oideachas Speisialta (STOS) le réimse tacaíochtaí a bhainistiú, a chomhordú agus a fhorbairt mar fhreagairt ar riachtanais oiliúna aitheanta na múinteoirí

source: The SESS, which is hosted in Cork Education Centre, provides a nationwide service to teachers and special needs assistants
ga: Cuireann an STOS, atá óstaithe in Ionad Oideachais Chorcaí, seirbhís ar fáil ar fud na tíre do mhúinteoirí agus do chúntóirí riachtanas speisialta

source: The aim of the service is to enhance the quality of teaching and learning with particular reference to the education of children with special needs
ga: Is í aidhm na seirbhíse ná cáilíocht an teagaisc agus na foghlama a fheabhsú go háirithe i dtaca le hoideachas leanaí a bhfuil riachtanais speisialta acu

source: The National Educational Psychological Service (NEPS)
ga: Seirbhís Náisiúnta Síceolaíochta Oideachais

source: The National Educational Psychological Service (NEPS) is an executive agency of the Department of Education and Skills
ga: Is gníomhaireacht fheidhmeannach den Roinn Oideachais agus Scileanna í an tSeirbhís Náisiúnta Síceolaíochta Oideachais (SNSO)

source: NEPS provides psychological services to primary and post-primary schools, both state and private
ga: Cuireann SNSO seirbhísí síceolaíochta ar fáil do bhunscoileanna agus d’iar-bhunscoileanna, idir scoileanna stáit agus scoileanna príobháideacha

source: NEPS processes applications for 'reasonable accommodation' in the State examination arrangements for children with disabilities
ga: Próiseálann SNSO iarratais ar “chóiríocht réasúnach” sna socruithe le haghaidh scrúduithe stáit do leanaí a bhfuil míchumais orthu

source: Department of Education and Skills
ga: An Roinn Oideachais agus Scileanna

source: National Council for Special Education
ga: An Chomhairle Náisiúnta um Oideachas Speisialta

source: There have been significant legal changes in recent years concerning special needs education
ga: Oideachas riachtanas speisialta - an dlí

source: These changes affect the rights of children with disabilities and other children who suffer educational disadvantage for whatever reason
ga: Tháinig athruithe suntasacha ar an dlí le blianta beaga anuas a bhfuil tionchar acu ar pháistí le míchumas nó ar pháistí atá faoi mhíbhuntáiste oideachais ar chúis ar bith

source: Special needs education means the special education arrangements in place for children with disabilities
ga: Déanann oideachas speisialta cur síos ar na socruithe oideachais atá ann do pháistí le míchumas

source: Measures to address educational disadvantage describes the supports provided for educationally disadvantaged children
ga: Déanann beartaíocht chun dul i ngleic le míbhuntáiste oideachais cur síos ar cén chaoi a dtéitear i ngleic go praicticiúil leis na cearta dleathúla atá ag páistí faoi mhíbhuntáiste

source: Education for Persons with Special Educational Needs Act 2004
ga: An tAcht um Oideachas do Dhaoine le Riachtanais Speisialta Oideachais 2004

source: The Education for Persons with Special Educational Needs Act 2004 (pdf) provides for the education of children aged under 18 years with special educational needs
ga: Forálann an tAcht um Oideachas do Dhaoine le Riachtanais Speisialta Oideachais 2004 go gcuirtear oideachas ar dhaoine óga faoi bhun 18 le riachtanais speisialta oideachais

source: The Act focuses on children’s education but there are references to further and adult education
ga: Leagtar béim san Acht ar oideachas leanaí ach tá tagairtí ann freisin do bhreisoideachas agus d’oideachas aosach

source: You are a person with special educational needs if your capacity to participate in and benefit from education is restricted due to an enduring physical, sensory, mental health or learning disability. While the Act is passed, all parts of it are not fully in effect
ga: Áirítear tú mar dhuine le riachtanais speisialta oideachais mura bhfuil sé ar do chumas bheith páirteach go hiomlán in oideachas agus tairbhe a bhaint as mar gheall ar mhíchumas buan, bíodh sé fisiceach, céadfach, meabhairshláinteach nó foghlamtha

source: • Provides that people with special educational needs are educated in an inclusive environment, as far as possible
ga: • Forálann sé go gcuirtear oideachas ar dhaoine le riachtanais speisialta oideachais i dtimpeallacht chuimsitheach, chomh fada agus is féidir

source: • Establishes that people with special educational needs have the same right to avail of and benefit from education as children who do not have those needs
ga: • Dearbhaíonn sé go bhfuil na cearta céanna ag daoine le riachtanais speisialta oideachais páirt a ghlacadh in oideachas agus tairbhe a bhaint as agus atá ag daoine nach bhfuil na riachtanais sin acu

source: • Provides for the greater involvement of parents in the education of their children and decision making
ga: • Forálann sé do bhreis rannpháirtíochta ag tuismitheoirí in oideachas a leanaí agus i gcinnteoireacht

source: • Establishes the National Council for Special Education (NCSE) on a statutory basis
ga: • Bunaíonn sé an Chomhairle Náisiúnta um Oideachas Speisialta (CNOS) ar bhonn reachtúil

source: • Gives statutory functions to the Health Service Executive with regard to the education of people with special educational needs
ga: • Tugann sé feidhmeanna reachtúla do bhoird sláinte (dá ngairtear Feidhmeannacht na Seirbhíse Sláinte) maidir le hoideachas daoine le riachtanais speisialta oideachais

source: • Establishes an independent appeals system – the Special Education Appeals Board – where decisions made about the education of people with special educational needs can be appealed
ga: • Bunaíonn sé córas neamhspleách achomhairc - an Bord Achomhairc um Oideachas Speisialta - le go bhféadfaí achomharc a dhéanamh in aghaidh cinntí maidir le socraithe oideachais do dhaoine le riachtanais speisialta oideachais

source: The Act sets out a range of services to be provided to people with special educational needs
ga: Ordaítear san Acht réimse seirbhísí le cur ar fáil do dhaoine le riachtanais speisialta oideachais

source: These include assessments, education plans and other support services
ga: Orthu sin tá measúnachtaí, pleananna oideachais agus seirbhísí tacaíochta eile

source: Parents can seek assessments of a child’s educational needs
ga: Féadfaidh tuismitheoirí measúnacht a iarraidh ar riachtanais speisialta a bpáistí

source: Assessments can be initiated by the Health Service Executive (HSE), by a school principal or by the National Council for Special Education
ga: Féadfaidh Feidhmeannacht na Seirbhíse Sláinte (FSS), príomhoide scoile nó an Chomhairle Náisiúnta um Oideachas Speisialta measúnachtaí a thionscnamh

source: The system for personal education plans is not yet in place and its implementation is being co-ordinated by the NCSE
ga: Níl an córas pleananna pearsanta oideachais ann fós. Tá an FSS ag comhordú an cur i gníomh

source: The HSE is currently responsible for providing health services to pre-school children and may provide speech and language therapy services
ga: Is í an Chomhairle Náisiúnta um Oideachas Speisialta (NCSE) a bheidh freagrach as seirbhísí a chur ar fáil do leanaí scoile

source: The NCSE will be responsible for providing services to school-going children
ga: Cuireann an NCSE acmhainní breise múinteoireachta agus eile ar fáil le tacú le riachtanais oideachais speisialta leanaí faoi mhíchumas

source: The Special Education Appeals Board and mediation
ga: Is iad seo a leanas feidhmeanna na Comhairle:

source: The 2004 Act provides for alternative methods of dispute resolution and encourages a move away from the courts as the forum for redress
ga: • Pleanáil le haghaidh cur i bhfeidhm Acht um Oideachas do Dhaoine a bhfuil Riachtanais Speisialta Oideachais Acu 2004

source: The Special Education Appeals Board was established in 2006 for the resolution of disputes and the determination of appeals and the first Board members were appointed
ga: • Monatóireacht a dhéanamh ar dhul chun cinn daltaí a bhfuil riachtanais speisialta oideachais acu agus athbhreithniú a dhéanamh ar na hacmhainní atá riachtanach sa réimse seo

source: When the Appeals Board comes into operation, the Act provides for the following:
ga: An Bord Achomhairc um Oideachas Speisialta agus idirghabháil

source: • If the council refuses to arrange an assessment of a child or to prepare an education plan, the parents of the child or the school principal may appeal to the Appeals Board
ga: Bunaíodh an Bord Achomhairc um Oideachas Speisialta i 2006 chun díospóidí a réiteach agus chun cinntí a dhéanamh faoi achomhairc, agus tá chéad bhaill an Bhoird ceaptha cheana féin
